{
  "id": "50-Question-gk-12",
  "title": "General Knowledge Quiz XII (50 Questions)",
  "description": "Challenging but fair across film/TV, games, architecture, chemistry, and island/seas geography. No sports content.",
  "sections": [
    {
      "title": "Film & Television II",
      "items": [
        {
          "q": "Who directed the film Spirited Away (2001)?",
          "a": "Hayao Miyazaki - Studio Ghibli film that won the 2003 Academy Award for Best Animated Feature"
        },
        {
          "q": "Which TV series features the law firm Pearson Specter Litt?",
          "a": "Suits - legal drama set in New York City"
        },
        {
          "q": "What is the highest‑grossing film of all time (worldwide, not adjusted for inflation)?",
          "a": "Avatar - James Cameron’s 2009 sci‑fi epic (surpassed earlier records)"
        },
        {
          "q": "Which actress played Ellen Ripley in the Alien franchise?",
          "a": "Sigourney Weaver - iconic sci‑fi action hero"
        },
        {
          "q": "Which 1999 film popularized bullet‑time action sequences?",
          "a": "The Matrix - directed by the Wachowskis"
        },
        {
          "q": "What is the name of the coffee shop in Friends?",
          "a": "Central Perk - the gang’s frequent hangout in Manhattan"
        },
        {
          "q": "Who created the TV series The Twilight Zone (1959)?",
          "a": "Rod Serling - anthology exploring speculative fiction and morality"
        },
        {
          "q": "Which 2016 streaming series follows a young queen’s early reign?",
          "a": "The Crown - dramatization of Queen Elizabeth II’s life"
        },
        {
          "q": "Who directed Parasite (2019), the first non‑English Best Picture winner at the Oscars?",
          "a": "Bong Joon‑ho - South Korean dark comedy thriller"
        },
        {
          "q": "Which show features a chemistry teacher who becomes a meth manufacturer?",
          "a": "Breaking Bad - created by Vince Gilligan; character Walter White"
        }
      ]
    },
    {
      "title": "Games (Board & Video) II",
      "items": [
        {
          "q": "Which board game involves building routes between cities with train cards?",
          "a": "Ticket to Ride - set collection and route‑building strategy"
        },
        {
          "q": "What 2017 video game by Nintendo features the kingdom of Hyrule in an open world?",
          "a": "The Legend of Zelda: Breath of the Wild - acclaimed open‑world design"
        },
        {
          "q": "Which board game uses polyomino tiles to fill a personal grid without gaps or overlaps?",
          "a": "Patchwork - two‑player game of quilting and time management"
        },
        {
          "q": "Which puzzle game involves matching falling geometric shapes to clear lines?",
          "a": "Tetris - created by Alexey Pajitnov in 1984"
        },
        {
          "q": "Which social deduction game asks players to find the impostor on a spaceship?",
          "a": "Among Us - online multiplayer hit by Innersloth (2018)"
        },
        {
          "q": "Which tabletop role‑playing game uses a twenty‑sided die as its core mechanic?",
          "a": "Dungeons & Dragons - first published in 1974"
        },
        {
          "q": "Which indie game tasks you with exploring a mysterious island while solving panel puzzles?",
          "a": "The Witness - 2016 puzzle game by Jonathan Blow"
        },
        {
          "q": "Which cooperative board game has players cure outbreaks across the globe?",
          "a": "Pandemic - team‑based strategy by Matt Leacock"
        },
        {
          "q": "Which game popularized the battle royale genre with last‑person‑standing matches?",
          "a": "PlayerUnknown’s Battlegrounds (PUBG) - 2017 release influencing many successors"
        },
        {
          "q": "Which deck‑building card game has players acquire copper, silver, and gold?",
          "a": "Dominion - seminal deck‑builder by Donald X. Vaccarino"
        }
      ]
    },
    {
      "title": "Architecture & Monuments II",
      "items": [
        {
          "q": "Which Mughal mausoleum in Agra is famed for its white marble and symmetry?",
          "a": "Taj Mahal - built by Shah Jahan for Mumtaz Mahal (completed 1653)"
        },
        {
          "q": "Which Parisian tower was built for the 1889 Exposition Universelle?",
          "a": "The Eiffel Tower - designed by Gustave Eiffel’s company"
        },
        {
          "q": "Which New York statue was a gift from France dedicated in 1886?",
          "a": "Statue of Liberty - ‘Liberty Enlightening the World’ on Liberty Island"
        },
        {
          "q": "Which ancient Greek temple on the Acropolis honors Athena Parthenos?",
          "a": "The Parthenon - 5th‑century BCE Doric masterpiece"
        },
        {
          "q": "Which Incan citadel sits atop a mountain ridge near Cusco?",
          "a": "Machu Picchu - 15th‑century site rediscovered by Hiram Bingham in 1911"
        },
        {
          "q": "Which Roman amphitheater in Rome could hold tens of thousands of spectators?",
          "a": "The Colosseum - Flavian amphitheater completed in 80 CE"
        },
        {
          "q": "Which cathedral in Paris is famed for its flying buttresses and Gothic architecture?",
          "a": "Notre‑Dame de Paris - begun in the 12th century on Île de la Cité"
        },
        {
          "q": "Which massive stone heads are found on Rapa Nui (Easter Island)?",
          "a": "Moai - carved by the Rapa Nui people between c. 1100 and 1600 CE"
        },
        {
          "q": "Which Islamic shrine in Jerusalem features a gold‑colored dome over the Foundation Stone?",
          "a": "Dome of the Rock - completed in 691–692 CE"
        },
        {
          "q": "Which sandstone city in Jordan features the Treasury (Al‑Khazneh) façade?",
          "a": "Petra - Nabataean city accessed through the Siq"
        }
      ]
    },
    {
      "title": "Chemistry & Materials II",
      "items": [
        {
          "q": "What is the lightest metal element?",
          "a": "Lithium - alkali metal with atomic number 3"
        },
        {
          "q": "Which polymer is commonly used in plastic bottles labeled PET?",
          "a": "Polyethylene terephthalate - polyester used in fibers and containers"
        },
        {
          "q": "What term describes a substance that speeds a chemical reaction without being consumed?",
          "a": "Catalyst - lowers activation energy, increasing reaction rate"
        },
        {
          "q": "Which gas is produced when acids react with carbonates (e.g., vinegar and baking soda)?",
          "a": "Carbon dioxide - effervescence from CO₂ release"
        },
        {
          "q": "What is the pH of a neutral aqueous solution at 25 °C?",
          "a": "7 - equal concentrations of H⁺ and OH⁻"
        },
        {
          "q": "Which element’s allotropes include graphite, diamond, and graphene?",
          "a": "Carbon - forms sp²/sp³ structures with diverse properties"
        },
        {
          "q": "What process separates crude oil into components by boiling point?",
          "a": "Fractional distillation - yields fractions like gasoline and diesel"
        },
        {
          "q": "Which compound is commonly known as table sugar?",
          "a": "Sucrose - disaccharide of glucose and fructose"
        },
        {
          "q": "What is the main component of natural gas?",
          "a": "Methane - CH₄, the simplest hydrocarbon"
        },
        {
          "q": "Which metal is liquid at room temperature besides mercury?",
          "a": "None at standard room temperature (~20 °C); gallium (~29.8 °C) and cesium (~28.5 °C) melt just above room temperature"
        }
      ]
    },
    {
      "title": "Geography: Islands & Seas II",
      "items": [
        {
          "q": "Which island nation lies off the southeastern coast of Africa in the Indian Ocean?",
          "a": "Madagascar - biodiversity hotspot with many endemic species"
        },
        {
          "q": "What strait separates the Arabian Peninsula from Africa at the Red Sea’s southern end?",
          "a": "Bab el‑Mandeb - connects the Red Sea to the Gulf of Aden"
        },
        {
          "q": "Which sea is bordered by Iran, Russia, Kazakhstan, Turkmenistan, and Azerbaijan?",
          "a": "The Caspian Sea - largest inland body of water on Earth"
        },
        {
          "q": "Which island is home to the city of Reykjavik?",
          "a": "Iceland - North Atlantic island nation with geothermal energy"
        },
        {
          "q": "Which channel separates England and France?",
          "a": "The English Channel - known as La Manche in French"
        },
        {
          "q": "Which Indonesian island is famous for Komodo dragons?",
          "a": "Komodo - part of the Lesser Sunda chain, a national park"
        },
        {
          "q": "Which Caribbean nation shares Hispaniola with Haiti?",
          "a": "Dominican Republic - eastern side of the island"
        },
        {
          "q": "Which sea between Europe and Asia is connected to the Mediterranean via the Dardanelles and Bosporus?",
          "a": "The Black Sea - linked by Turkish straits"
        },
        {
          "q": "Which archipelago nation consists of more than 7,000 islands in Southeast Asia?",
          "a": "The Philippines - island nation in the western Pacific"
        },
        {
          "q": "Which island country in Oceania has Wellington as its capital?",
          "a": "New Zealand - main islands are North and South Island"
        }
      ]
    }
  ]
}