{
  "id": "50-Question-gk-10",
  "title": "General Knowledge Quiz X (50 Questions)",
  "description": "Challenging but fair across space, ideas, language, inventions, and physical geography. No sports content.",
  "sections": [
    {
      "title": "Space & Astronomy II",
      "items": [
        {
          "q": "Which planet has a day (rotation) longer than its year (revolution)?",
          "a": "Venus - rotates very slowly and retrograde; a Venusian day exceeds a Venusian year"
        },
        {
          "q": "What is the term for the point in an orbit farthest from the Sun?",
          "a": "Aphelion - counterpart is perihelion (closest)"
        },
        {
          "q": "Which NASA mission first landed humans on the Moon?",
          "a": "Apollo 11 - Neil Armstrong and Buzz Aldrin landed July 20, 1969"
        },
        {
          "q": "What is the largest moon of Saturn?",
          "a": "Titan - thick nitrogen atmosphere and hydrocarbon lakes"
        },
        {
          "q": "Which type of star ends its life as a neutron star or black hole after a supernova?",
          "a": "Massive star - core‑collapse supernova can leave compact remnants"
        },
        {
          "q": "What structure is the flat, disk‑like region of icy bodies beyond Neptune?",
          "a": "The Kuiper Belt - source of many short‑period comets"
        },
        {
          "q": "What is the name for the apparent path of the Sun across the sky among the constellations?",
          "a": "The ecliptic - plane of Earth’s orbit projected on the celestial sphere"
        },
        {
          "q": "Which telescope succeeded Hubble with infrared capabilities launched in 2021?",
          "a": "James Webb Space Telescope - operates at L2 to observe the early universe"
        },
        {
          "q": "What is the term for a planet outside our solar system?",
          "a": "Exoplanet - thousands detected via transits and radial velocity"
        },
        {
          "q": "Which dwarf planet was reclassified from planetary status in 2006?",
          "a": "Pluto - redefined by the IAU’s criteria for planet classification"
        }
      ]
    },
    {
      "title": "Philosophy & Thought II",
      "items": [
        {
          "q": "Which ancient Greek philosopher taught Alexander the Great?",
          "a": "Aristotle - student of Plato and tutor to the Macedonian prince"
        },
        {
          "q": "What does ‘cogito, ergo sum’ translate to in English?",
          "a": "“I think, therefore I am.” - foundational claim by René Descartes"
        },
        {
          "q": "Which branch of philosophy concerns right and wrong action?",
          "a": "Ethics - includes theories like deontology and consequentialism"
        },
        {
          "q": "Who wrote the 18th‑century work Critique of Pure Reason?",
          "a": "Immanuel Kant - a central text in modern epistemology and metaphysics"
        },
        {
          "q": "Which movement asserts that existence precedes essence?",
          "a": "Existentialism - associated with Sartre, de Beauvoir, and others"
        },
        {
          "q": "What is the ‘allegory of the cave’ meant to illustrate?",
          "a": "Plato’s theory of forms and enlightenment - prisoners mistake shadows for reality"
        },
        {
          "q": "Which philosopher is known for the ‘categorical imperative’?",
          "a": "Immanuel Kant - universal moral law derived from reason"
        },
        {
          "q": "Which 19th‑century thinker wrote Thus Spoke Zarathustra?",
          "a": "Friedrich Nietzsche - work introducing the Übermensch and eternal recurrence"
        },
        {
          "q": "What is the study of valid reasoning and inference called?",
          "a": "Logic - includes propositional and predicate calculus"
        },
        {
          "q": "Which Chinese text emphasizes harmony with the Dao and non‑action (wu wei)?",
          "a": "Tao Te Ching - foundational Daoist work attributed to Laozi"
        }
      ]
    },
    {
      "title": "Language & Etymology II",
      "items": [
        {
          "q": "What is the term for a word that sounds like what it describes (e.g., buzz)?",
          "a": "Onomatopoeia - words imitating natural sounds"
        },
        {
          "q": "Which language family includes Hindi, Persian, and English?",
          "a": "Indo‑European - widespread family across Europe and South Asia"
        },
        {
          "q": "What is the process of forming a new word by blending parts of two words (e.g., brunch)?",
          "a": "Portmanteau - coined by Lewis Carroll, combining sound and meaning"
        },
        {
          "q": "Which writing system uses characters that each represent a syllable?",
          "a": "Syllabary - examples include Japanese kana"
        },
        {
          "q": "What is the study of the structure of words (roots, prefixes, suffixes) called?",
          "a": "Morphology - branch of linguistics analyzing word formation"
        },
        {
          "q": "Which punctuation mark is used to join independent but related clauses?",
          "a": "Semicolon - links closely related statements"
        },
        {
          "q": "What is the term for a word with the opposite meaning of another?",
          "a": "Antonym - opposite of a synonym"
        },
        {
          "q": "Which language is the primary liturgical language of the Roman Catholic Church historically?",
          "a": "Latin - used in the traditional Mass and ecclesiastical texts"
        },
        {
          "q": "What is a borrowed word that retains its original pronunciation or form called?",
          "a": "Loanword - adopted from another language with minimal changes"
        },
        {
          "q": "Which language revived as a spoken vernacular after centuries of liturgical use in the late 19th/early 20th century?",
          "a": "Modern Hebrew - standardized and popularized by Eliezer Ben‑Yehuda and others"
        }
      ]
    },
    {
      "title": "Inventions & Discoveries II",
      "items": [
        {
          "q": "Who invented movable‑type printing in Europe around 1450?",
          "a": "Johannes Gutenberg - printing press revolutionized book production"
        },
        {
          "q": "Which pair discovered the structure of DNA in 1953 using X‑ray data?",
          "a": "James Watson and Francis Crick - double helix model (with crucial work by Rosalind Franklin)"
        },
        {
          "q": "Who is credited with patenting the first practical telephone in 1876?",
          "a": "Alexander Graham Bell - US Patent 174,465 granted March 7, 1876"
        },
        {
          "q": "Which physicist formulated the laws of electromagnetism as a set of equations?",
          "a": "James Clerk Maxwell - unified electricity, magnetism, and light"
        },
        {
          "q": "Who developed the first successful polio vaccine in the 1950s?",
          "a": "Jonas Salk - inactivated (killed) virus vaccine introduced in 1955"
        },
        {
          "q": "Which engineer pioneered alternating‑current power systems in the 1880s–90s?",
          "a": "Nikola Tesla - AC induction motor and polyphase power distribution"
        },
        {
          "q": "Who created the programming language Fortran (1957) at IBM?",
          "a": "John Backus and team - early high‑level language for scientific computing"
        },
        {
          "q": "Which chemist discovered benzene’s ring structure after a famous daydream?",
          "a": "August Kekulé - proposed the cyclic structure in the 1860s"
        },
        {
          "q": "Who first successfully vaccinated against smallpox in 1796?",
          "a": "Edward Jenner - used cowpox material to confer immunity"
        },
        {
          "q": "Which astronomer cataloged nebulae and clusters, giving his name to Messier objects (M1, M31, etc.)?",
          "a": "Charles Messier - 18th‑century comet hunter who compiled a famous catalog"
        }
      ]
    },
    {
      "title": "Geography: Mountains & Rivers",
      "items": [
        {
          "q": "What is the highest mountain in Africa?",
          "a": "Mount Kilimanjaro - a stratovolcano in Tanzania, 5,895 m (19,341 ft)"
        },
        {
          "q": "Which river runs through the Grand Canyon?",
          "a": "The Colorado River - carved the canyon over millions of years"
        },
        {
          "q": "What mountain range forms a natural border between France and Spain?",
          "a": "The Pyrenees - stretching from the Bay of Biscay to the Mediterranean"
        },
        {
          "q": "Which river is the longest in South America?",
          "a": "The Amazon - by discharge the largest on Earth; by length among the longest"
        },
        {
          "q": "What is the highest peak in the Alps?",
          "a": "Mont Blanc - on the France–Italy border, 4,808 m (15,774 ft)"
        },
        {
          "q": "Which Asian river is known as the Huang He?",
          "a": "The Yellow River - cradle of Chinese civilization"
        },
        {
          "q": "What mountain range includes Mount Everest?",
          "a": "The Himalayas - vast range across South and East Asia"
        },
        {
          "q": "Which European river flows through Vienna, Bratislava, Budapest, and Belgrade?",
          "a": "The Danube - second‑longest river in Europe"
        },
        {
          "q": "What is the longest river in Europe?",
          "a": "The Volga - flowing through central Russia to the Caspian Sea"
        },
        {
          "q": "Which mountain range runs the length of Italy’s peninsula?",
          "a": "The Apennines - backbone of the Italian Peninsula"
        }
      ]
    }
  ]
}