{
  "id": "50-Question-gk-16",
  "title": "General Knowledge Quiz XVI (50 Questions)",
  "description": "Challenging but fair across logic, cultural traditions, biology, mathematics, and inventions. No sports content.",
  "sections": [
    {
      "title": "Philosophy: Logic & Fallacies II",
      "items": [
        {
          "q": "What fallacy attacks a person’s character instead of addressing the argument?",
          "a": "Ad hominem - diverts from the actual issue"
        },
        {
          "q": "Which fallacy assumes what it’s trying to prove (circular reasoning)?",
          "a": "Begging the question - petitio principii"
        },
        {
          "q": "What is the valid argument form: If P→Q, P; therefore Q?",
          "a": "Modus ponens - rule of inference in propositional logic"
        },
        {
          "q": "What is the fallacy of falsely reducing options to two?",
          "a": "False dilemma - overlooks alternatives"
        },
        {
          "q": "What is the valid argument form: If P→Q, ¬Q; therefore ¬P?",
          "a": "Modus tollens - contrapositive inference"
        },
        {
          "q": "Which fallacy infers causation from mere correlation?",
          "a": "Post hoc (false cause) - cum hoc ergo propter hoc"
        },
        {
          "q": "What is a contradiction in formal logic?",
          "a": "A statement that is always false - cannot be true under any valuation"
        },
        {
          "q": "What is Occam’s razor?",
          "a": "Heuristic favoring simpler explanations when all else is equal"
        },
        {
          "q": "What does ‘non sequitur’ mean in logical discourse?",
          "a": "“It does not follow.” - conclusion does not logically follow from premises"
        },
        {
          "q": "Which fallacy misrepresents an opponent’s argument to make it easier to attack?",
          "a": "Straw man - distorts or oversimplifies the claim"
        }
      ]
    },
    {
      "title": "Cultural Traditions & Festivals II",
      "items": [
        {
          "q": "Which Japanese spring tradition involves viewing cherry blossoms?",
          "a": "Hanami - festive appreciation of sakura in bloom"
        },
        {
          "q": "Which Mexican holiday honors deceased loved ones with altars and marigolds?",
          "a": "Día de los Muertos (Day of the Dead) - celebrated Nov 1–2"
        },
        {
          "q": "Which Indian harvest festival is celebrated in Punjab with bhangra dancing?",
          "a": "Baisakhi (Vaisakhi) - marks Sikh New Year and harvest"
        },
        {
          "q": "Which Muslim festival ends the month of Ramadan?",
          "a": "Eid al‑Fitr - ‘Festival of Breaking the Fast’"
        },
        {
          "q": "Which Chinese festival is marked by lanterns on the 15th day of the first lunar month?",
          "a": "Lantern Festival - closes Lunar New Year celebrations"
        },
        {
          "q": "Which Brazilian festival features samba parades and elaborate costumes before Lent?",
          "a": "Carnaval - Rio’s world‑famous pre‑Lenten celebration"
        },
        {
          "q": "Which Jewish festival commemorates the rededication of the Second Temple?",
          "a": "Hanukkah - Festival of Lights lasting eight nights"
        },
        {
          "q": "Which Thai festival releases candlelit baskets onto waterways?",
          "a": "Loy Krathong - also features sky lanterns in some regions"
        },
        {
          "q": "Which Celtic festival is considered a precursor to Halloween?",
          "a": "Samhain - marks the end of harvest and beginning of winter"
        },
        {
          "q": "Which Hindu festival celebrates the birth of Krishna?",
          "a": "Janmashtami - observed with fasting, singing, and temple rituals"
        }
      ]
    },
    {
      "title": "Biology: Animals & Plants II",
      "items": [
        {
          "q": "What is the largest living bird by height?",
          "a": "Ostrich - flightless bird native to Africa"
        },
        {
          "q": "Which mammal lays eggs instead of giving birth to live young?",
          "a": "Platypus - monotreme along with echidnas"
        },
        {
          "q": "What is the process by which caterpillars become butterflies?",
          "a": "Metamorphosis - transformation via pupal stage"
        },
        {
          "q": "Which plant family includes peas, beans, and lentils that fix nitrogen?",
          "a": "Legumes (Fabaceae) - symbiosis with Rhizobium bacteria"
        },
        {
          "q": "Which reptile group includes crocodiles and alligators?",
          "a": "Crocodilians - order Crocodylia"
        },
        {
          "q": "What pigment gives plants their green color?",
          "a": "Chlorophyll - absorbs blue and red light for photosynthesis"
        },
        {
          "q": "Which desert plant stores water in thick stems and has spines instead of leaves?",
          "a": "Cactus - adaptations reduce water loss"
        },
        {
          "q": "Which marine mammals are known for complex songs and baleen plates?",
          "a": "Humpback whales - filter feeders with elaborate vocalizations"
        },
        {
          "q": "Which biome features evergreen conifers and long winters across high latitudes?",
          "a": "Taiga (boreal forest) - dominated by spruce, fir, and pine"
        },
        {
          "q": "Which fungi‑plant association aids nutrient uptake in roots?",
          "a": "Mycorrhizae - mutualistic relationship enhancing absorption"
        }
      ]
    },
    {
      "title": "Mathematics: Numbers & Patterns II",
      "items": [
        {
          "q": "What sequence begins 0, 1, 1, 2, 3, 5, 8…?",
          "a": "Fibonacci sequence - each term is the sum of the previous two"
        },
        {
          "q": "What is the value of the golden ratio φ to two decimal places?",
          "a": "Approximately 1.62 - (1+√5)/2 ≈ 1.618"
        },
        {
          "q": "What do we call a number divisible only by 1 and itself?",
          "a": "Prime number - fundamental in number theory"
        },
        {
          "q": "What is the sum of interior angles of a triangle?",
          "a": "180 degrees - in Euclidean geometry"
        },
        {
          "q": "Which theorem relates the sides of a right triangle (a²+b²=c²)?",
          "a": "Pythagorean theorem - c is the hypotenuse"
        },
        {
          "q": "What do we call a polygon with all sides and angles equal?",
          "a": "Regular polygon - e.g., equilateral triangle, square"
        },
        {
          "q": "What is the decimal expansion that repeats the pattern 0.333… called?",
          "a": "Recurring (repeating) decimal - equals 1/3"
        },
        {
          "q": "What is 7! (7 factorial)?",
          "a": "5040 - product of integers from 1 to 7"
        },
        {
          "q": "What do we call symmetry around a central point where rotation leaves a figure unchanged?",
          "a": "Rotational symmetry - order depends on number of orientations"
        },
        {
          "q": "What is the least common multiple (LCM) of 6 and 8?",
          "a": "24 - smallest multiple divisible by both numbers"
        }
      ]
    },
    {
      "title": "Inventions & Inventors II",
      "items": [
        {
          "q": "Who invented the first successful airplane in 1903?",
          "a": "The Wright brothers (Orville and Wilbur) - first powered, controlled flight at Kitty Hawk"
        },
        {
          "q": "Who developed the first practical lightbulb with a long‑lasting filament?",
          "a": "Thomas Edison - carbon filament lamp commercialized in 1879"
        },
        {
          "q": "Who invented the safety elevator with a fail‑safe brake?",
          "a": "Elisha Otis - demonstration in 1854 boosted skyscraper development"
        },
        {
          "q": "Who created the first commercially successful photographic process (daguerreotype)?",
          "a": "Louis Daguerre - introduced in 1839"
        },
        {
          "q": "Who pioneered the assembly line for mass production of automobiles?",
          "a": "Henry Ford - Model T production revolutionized manufacturing"
        },
        {
          "q": "Who is credited with inventing the modern refrigerator using vapor compression?",
          "a": "Carl von Linde - 1876 refrigeration cycle improvements"
        },
        {
          "q": "Who pioneered radio transmission and received the 1909 Nobel Prize?",
          "a": "Guglielmo Marconi - long‑distance wireless telegraphy"
        },
        {
          "q": "Who invented the first commercial microprocessor in 1971?",
          "a": "Intel team (Federico Faggin, Ted Hoff, Stan Mazor) - Intel 4004"
        },
        {
          "q": "Who patented the first practical typewriter and QWERTY keyboard layout?",
          "a": "Christopher Latham Sholes - U.S. patent in 1868"
        },
        {
          "q": "Who invented the first mechanical television system demonstrated in 1926?",
          "a": "John Logie Baird - early electromechanical TV pioneer"
        }
      ]
    }
  ]
}