{
  "id": "50-Question-gk-15",
  "title": "General Knowledge Quiz XV (50 Questions)",
  "description": "Challenging but fair across art, history, astronomy, cities/landmarks, and SI units. No sports content.",
  "sections": [
    {
      "title": "Art Movements & Techniques II",
      "items": [
        {
          "q": "Which early 20th‑century movement emphasized geometric forms and multiple viewpoints?",
          "a": "Cubism - pioneered by Picasso and Braque"
        },
        {
          "q": "Which movement explored the unconscious and dream imagery in the 1920s–30s?",
          "a": "Surrealism - associated with Dalí, Magritte, and Breton"
        },
        {
          "q": "Which style used dramatic light and shadow contrasts known as chiaroscuro?",
          "a": "Baroque - exemplified by Caravaggio and Rembrandt"
        },
        {
          "q": "What is the technique of painting with pigment mixed into hot wax?",
          "a": "Encaustic - used in ancient Fayum portraits"
        },
        {
          "q": "Which movement celebrated modern life and technology with speed and dynamism?",
          "a": "Futurism - Italian avant‑garde of the 1910s"
        },
        {
          "q": "What is the method of applying paint in tiny dots of pure color?",
          "a": "Pointillism (Divisionism) - practiced by Seurat and Signac"
        },
        {
          "q": "Which decorative style of the late 19th century featured flowing lines and organic motifs?",
          "a": "Art Nouveau - exemplified by Mucha and Horta"
        },
        {
          "q": "Which 1960s movement used imagery from advertising and mass media?",
          "a": "Pop Art - led by Andy Warhol and Roy Lichtenstein"
        },
        {
          "q": "What term describes mural painting on fresh wet plaster?",
          "a": "Fresco - pigments bond as the plaster cures"
        },
        {
          "q": "Which Japanese woodblock print genre flourished in the Edo period?",
          "a": "Ukiyo‑e - ‘pictures of the floating world’ by artists like Hokusai"
        }
      ]
    },
    {
      "title": "World History: Revolutions & Treaties II",
      "items": [
        {
          "q": "Which conflict in North America culminated with the Siege of Yorktown (1781)?",
          "a": "The American Revolutionary War - decisive Franco‑American victory at Yorktown"
        },
        {
          "q": "Which 1789 event marked the beginning of the French Revolution?",
          "a": "The Storming of the Bastille - July 14, 1789"
        },
        {
          "q": "Which 1848 publication by Marx and Engels outlined a critique of capitalism?",
          "a": "The Communist Manifesto - influential political pamphlet"
        },
        {
          "q": "Which 1917 declaration expressed British support for a “national home for the Jewish people” in Palestine?",
          "a": "The Balfour Declaration - letter to Lord Rothschild, November 2, 1917"
        },
        {
          "q": "Which 1918 armistice ended fighting on the Western Front of World War I?",
          "a": "Armistice of Compiègne - signed November 11, 1918"
        },
        {
          "q": "Which 1947 partition plan proposed separate Jewish and Arab states in Mandatory Palestine?",
          "a": "UN General Assembly Resolution 181 - Partition Plan of 1947"
        },
        {
          "q": "Which 1954 agreement ended French colonial rule in Indochina?",
          "a": "Geneva Accords - temporarily divided Vietnam at the 17th parallel"
        },
        {
          "q": "Which 1962 agreement resolved the Cuban Missile Crisis?",
          "a": "U.S.–Soviet understanding - withdrawal of missiles and secret Jupiter removal from Turkey"
        },
        {
          "q": "Which 1978 accords led to the Egypt–Israel Peace Treaty?",
          "a": "Camp David Accords - brokered by U.S. President Jimmy Carter"
        },
        {
          "q": "Which 1993 agreements established Palestinian self‑governance in parts of the West Bank and Gaza?",
          "a": "Oslo Accords - Declaration of Principles signed on the White House lawn"
        }
      ]
    },
    {
      "title": "Astronomy: Planets & Moons II",
      "items": [
        {
          "q": "Which planet is known for its prominent Great Red Spot?",
          "a": "Jupiter - long‑lived anticyclonic storm larger than Earth"
        },
        {
          "q": "Which Martian volcano is the largest in the solar system?",
          "a": "Olympus Mons - shield volcano about 22 km high"
        },
        {
          "q": "Which moon of Jupiter is believed to harbor a subsurface ocean beneath an icy crust?",
          "a": "Europa - potential astrobiological interest"
        },
        {
          "q": "Which ringed planet has a hexagon‑shaped jet stream at its north pole?",
          "a": "Saturn - hexagon discovered by Voyager, observed by Cassini"
        },
        {
          "q": "Which dwarf planet in the asteroid belt was visited by NASA’s Dawn mission?",
          "a": "Ceres - first dwarf planet discovered (1801)"
        },
        {
          "q": "Which moon of Saturn has geysers erupting from its south polar region?",
          "a": "Enceladus - jets of water ice discovered by Cassini"
        },
        {
          "q": "Which planet has the highest mean surface temperature due to a runaway greenhouse effect?",
          "a": "Venus - dense CO₂ atmosphere traps heat"
        },
        {
          "q": "Which two planets lack natural moons?",
          "a": "Mercury and Venus - no confirmed satellites"
        },
        {
          "q": "Which moon is the largest in the solar system?",
          "a": "Ganymede - larger than Mercury"
        },
        {
          "q": "Which planet has a day about 24 hours long, similar to Earth’s?",
          "a": "Mars - rotation period ~24 hours 37 minutes"
        }
      ]
    },
    {
      "title": "Geography: Cities & Landmarks II",
      "items": [
        {
          "q": "Which city is home to the Kremlin and Red Square?",
          "a": "Moscow - capital of Russia"
        },
        {
          "q": "Which city’s opera house is famed for its sail‑like design by Jørn Utzon?",
          "a": "Sydney - the Sydney Opera House, opened in 1973"
        },
        {
          "q": "Which Italian city is known for its Leaning Tower?",
          "a": "Pisa - freestanding bell tower of the cathedral"
        },
        {
          "q": "Which city features the Christ the Redeemer statue atop Corcovado?",
          "a": "Rio de Janeiro - 1931 Art Deco statue"
        },
        {
          "q": "Which city’s Golden Gate Bridge spans the entrance to a Pacific bay?",
          "a": "San Francisco - suspension bridge completed in 1937"
        },
        {
          "q": "Which Egyptian city houses the Great Pyramid complex at Giza?",
          "a": "Giza - part of Greater Cairo metropolitan area"
        },
        {
          "q": "Which Indian city contains the Gateway of India monument?",
          "a": "Mumbai - arch built to commemorate the 1911 royal visit"
        },
        {
          "q": "Which British city has the Roman baths and Georgian crescents giving it UNESCO status?",
          "a": "Bath - famed for thermal springs and Palladian architecture"
        },
        {
          "q": "Which Chinese city hosts the Forbidden City palace complex?",
          "a": "Beijing - imperial seat from the Ming to the Qing dynasty"
        },
        {
          "q": "Which Turkish city straddles two continents?",
          "a": "Istanbul - spans Europe and Asia across the Bosporus"
        }
      ]
    },
    {
      "title": "Science: Measurement & SI Units II",
      "items": [
        {
          "q": "What is the SI base unit of amount of substance?",
          "a": "Mole (mol) - defined via Avogadro constant 6.02214076×10^23"
        },
        {
          "q": "What SI unit measures electric charge?",
          "a": "Coulomb (C) - equals one ampere‑second"
        },
        {
          "q": "What is the SI base unit of luminous intensity?",
          "a": "Candela (cd) - defined via monochromatic radiation at 540 THz"
        },
        {
          "q": "Which SI prefix denotes one billion (10^9)?",
          "a": "Giga (G) - examples: gigabyte (GB)"
        },
        {
          "q": "What is the SI derived unit for pressure?",
          "a": "Pascal (Pa) - one newton per square meter"
        },
        {
          "q": "What is the SI base unit for temperature?",
          "a": "Kelvin (K) - defined via the Boltzmann constant"
        },
        {
          "q": "Which SI prefix denotes one trillionth (10^−12)?",
          "a": "Pico (p) - examples: picometer (pm)"
        },
        {
          "q": "What is the derived SI unit for frequency?",
          "a": "Hertz (Hz) - one cycle per second"
        },
        {
          "q": "Which SI prefix denotes one millionth (10^−6)?",
          "a": "Micro (μ) - examples: microliter (μL)"
        },
        {
          "q": "What is the SI base unit for length?",
          "a": "Meter (m) - defined via the speed of light in vacuum"
        }
      ]
    }
  ]
}