{
  "id": "50-Question-gk-7",
  "title": "General Knowledge Quiz VII (50 Questions)",
  "description": "Challenging but fair. New categories: Sports & Games, Food & Drink, Business & Economics, Medicine & Human Body, Space & Astronomy.",
  "sections": [
    {
      "title": "Sports & Games",
      "items": [
        {
          "q": "Which nation won the first FIFA World Cup in 1930?",
          "a": "Uruguay - hosts and inaugural champions"
        },
        {
          "q": "How many squares are on a standard chessboard?",
          "a": "64 - arranged in an 8×8 grid of alternating colors"
        },
        {
          "q": "In tennis, how many Grand Slam tournaments are there each year?",
          "a": "Four - Australian Open, Roland Garros, Wimbledon, US Open"
        },
        {
          "q": "What is the term for three strikes in a row in ten‑pin bowling?",
          "a": "Turkey - bowling slang for a triple strike"
        },
        {
          "q": "In cricket, what is the traditional maximum length of a Test match?",
          "a": "Five days - with up to 90 overs scheduled per day"
        },
        {
          "q": "Which piece combines the moves of the rook and bishop in chess?",
          "a": "The queen - moves any number of squares straight or diagonally"
        },
        {
          "q": "Which country hosts the Tour de France cycling race?",
          "a": "France - multi‑stage race established in 1903"
        },
        {
          "q": "In association football, what is the maximum number of players per side on the field?",
          "a": "11 - including the goalkeeper"
        },
        {
          "q": "What is the only Olympic sport where competitors can legally deliver a punch?",
          "a": "Boxing - governed by weight classes and protective gear"
        },
        {
          "q": "In rugby union, how many points is a try worth (modern scoring)?",
          "a": "Five - plus potential two‑point conversion on the kick"
        }
      ]
    },
    {
      "title": "Food & Drink",
      "items": [
        {
          "q": "What protected name is reserved for sparkling wine from a specific French region?",
          "a": "Champagne - must come from Champagne and follow AOC rules"
        },
        {
          "q": "Which spice comes from the dried stigmas of Crocus sativus?",
          "a": "Saffron - prized threads used for flavor and color"
        },
        {
          "q": "In Japanese cuisine, what is sushi rice seasoned with?",
          "a": "Rice vinegar (with sugar and salt) - gives sushi its tang and texture"
        },
        {
          "q": "Chocolate is made from the seeds of which plant?",
          "a": "The cacao tree (Theobroma cacao) - fermented and roasted beans"
        },
        {
          "q": "What culinary scale measures the heat of chili peppers?",
          "a": "The Scoville scale - based on capsaicin concentration"
        },
        {
          "q": "What Italian cheese is traditionally aged in brine and has a DOC status from Parma?",
          "a": "Parmigiano‑Reggiano - hard grana cheese often grated"
        },
        {
          "q": "Which sauce is an emulsion of oil and egg yolk, often used on sandwiches?",
          "a": "Mayonnaise - classic cold emulsion"
        },
        {
          "q": "What is the main ingredient in hummus besides tahini and lemon?",
          "a": "Chickpeas - blended to a creamy spread"
        },
        {
          "q": "Which beverage’s name literally means 'baked tea' in Chinese?",
          "a": "Pu‑erh - fermented, aged tea traditionally pressed into cakes"
        },
        {
          "q": "Which country is the origin of the flatbread 'injera'?",
          "a": "Ethiopia - spongy sourdough made from teff flour"
        }
      ]
    },
    {
      "title": "Business & Economics",
      "items": [
        {
          "q": "Who wrote The Wealth of Nations (1776)?",
          "a": "Adam Smith - foundational work of classical economics"
        },
        {
          "q": "What does GDP stand for in economics?",
          "a": "Gross Domestic Product - total value of goods and services produced"
        },
        {
          "q": "What market name is an acronym for National Association of Securities Dealers Automated Quotations?",
          "a": "NASDAQ - major U.S. electronic stock exchange"
        },
        {
          "q": "What index is widely used to track consumer inflation in the U.S.?",
          "a": "CPI (Consumer Price Index) - measures price changes in a market basket"
        },
        {
          "q": "Which 1944 conference created the IMF and what became the World Bank?",
          "a": "Bretton Woods - established the IMF and IBRD institutions"
        },
        {
          "q": "What term describes a sustained decline in general price levels?",
          "a": "Deflation - the opposite of inflation"
        },
        {
          "q": "What do we call a market dominated by a single seller?",
          "a": "Monopoly - can restrict output and raise prices"
        },
        {
          "q": "Which ratio is current assets divided by current liabilities?",
          "a": "Current ratio - a basic liquidity measure"
        },
        {
          "q": "What do economists call the cost of the next best forgone alternative?",
          "a": "Opportunity cost - core concept in decision‑making"
        },
        {
          "q": "Which U.S. stock index tracks 30 large industrial companies?",
          "a": "The Dow Jones Industrial Average - price‑weighted index"
        }
      ]
    },
    {
      "title": "Medicine & Human Body",
      "items": [
        {
          "q": "Which hormone produced by pancreatic beta cells lowers blood glucose?",
          "a": "Insulin - secreted by islets of Langerhans in the pancreas"
        },
        {
          "q": "Where does most blood cell formation occur in adults?",
          "a": "Bone marrow - site of hematopoiesis for red and many white cells"
        },
        {
          "q": "What is the largest organ of the human body by surface area?",
          "a": "The skin - protective barrier and thermoregulator"
        },
        {
          "q": "Which bone is the longest and strongest in the human body?",
          "a": "The femur - thighbone forming the hip and knee joints"
        },
        {
          "q": "Which virus causes the disease COVID‑19?",
          "a": "SARS‑CoV‑2 - a coronavirus identified in late 2019"
        },
        {
          "q": "What is the medical term for high blood pressure?",
          "a": "Hypertension - chronic elevation of arterial pressure"
        },
        {
          "q": "Which vitamin is crucial for calcium absorption and bone health?",
          "a": "Vitamin D - synthesized in skin with sunlight exposure"
        },
        {
          "q": "What is the term for the body’s ability to maintain internal stability?",
          "a": "Homeostasis - dynamic equilibrium across systems"
        },
        {
          "q": "Which blood type is known as the universal donor for red cells?",
          "a": "O negative - lacks A, B, and Rh antigens"
        },
        {
          "q": "Which iron‑containing protein carries oxygen in red blood cells?",
          "a": "Hemoglobin - binds oxygen in the lungs and releases it in tissues"
        }
      ]
    },
    {
      "title": "Space & Astronomy",
      "items": [
        {
          "q": "What is the nearest major galaxy to the Milky Way?",
          "a": "Andromeda (M31) - about 2.5 million light‑years away"
        },
        {
          "q": "What space telescope was deployed by STS‑31 in April 1990?",
          "a": "The Hubble Space Telescope - launched aboard Space Shuttle Discovery"
        },
        {
          "q": "Which planet has the most extensive ring system?",
          "a": "Saturn - rings composed largely of ice particles and dust"
        },
        {
          "q": "What is a light‑year a measure of?",
          "a": "Distance - the span light travels in one year"
        },
        {
          "q": "Which dwarf planet lies in the asteroid belt?",
          "a": "Ceres - first discovered in 1801 by Giuseppe Piazzi"
        },
        {
          "q": "What are the two main types of star clusters?",
          "a": "Open and globular clusters - loosely bound vs dense spherical groups"
        },
        {
          "q": "What term describes a star’s explosive death that outshines its host galaxy?",
          "a": "Supernova - can seed space with heavier elements"
        },
        {
          "q": "Which NASA rover landed on Mars in 2021?",
          "a": "Perseverance - mission includes the Ingenuity helicopter"
        },
        {
          "q": "What is the boundary around a black hole from which nothing can escape?",
          "a": "Event horizon - where escape velocity exceeds light speed"
        },
        {
          "q": "What is the name of the galaxy cluster that includes the Milky Way?",
          "a": "The Local Group - small cluster containing dozens of galaxies"
        }
      ]
    }
  ]
}