{
  "id": "50-Question-gk-8",
  "title": "General Knowledge Quiz VIII (50 Questions)",
  "description": "Challenging but fair. New categories: Language & Etymology, Inventions & Discoveries, Philosophy & Religion, Environment & Ecology, Exploration & Cartography.",
  "sections": [
    {
      "title": "Language & Etymology",
      "items": [
        {
          "q": "The word 'robot' was popularized by which 1920 play by Karel Čapek?",
          "a": "R.U.R. (Rossum’s Universal Robots) - introduced 'robot' from Czech 'robota' (forced labor)"
        },
        {
          "q": "Which ancient seafaring people spread an influential 22‑letter abjad?",
          "a": "The Phoenicians - script that influenced Greek and Latin alphabets"
        },
        {
          "q": "What is a sentence that uses every letter of the alphabet at least once called?",
          "a": "A pangram - e.g., 'The quick brown fox jumps over the lazy dog'"
        },
        {
          "q": "Who designed the first widely known set of emoji in 1999?",
          "a": "Shigetaka Kurita - 176 pixel icons for NTT DoCoMo in Japan"
        },
        {
          "q": "What do linguists call a word formed from the initial letters of a phrase (e.g., NASA)?",
          "a": "An acronym - pronounced as a word (vs. initialism like FBI)"
        },
        {
          "q": "What is the study of word origins and historical development called?",
          "a": "Etymology - traces how meanings and forms change over time"
        },
        {
          "q": "Which punctuation mark is used to indicate possession or contractions?",
          "a": "The apostrophe - also used for omitted letters"
        },
        {
          "q": "What is the most widely spoken Romance language by native speakers?",
          "a": "Spanish - evolved from Vulgar Latin on the Iberian Peninsula"
        },
        {
          "q": "What is the official language regulator for modern French?",
          "a": "Académie française - founded in 1635 to standardize French"
        },
        {
          "q": "Which writing direction do Arabic and Hebrew primarily use?",
          "a": "Right‑to‑left - with contextual letter shaping"
        }
      ]
    },
    {
      "title": "Inventions & Discoveries",
      "items": [
        {
          "q": "Who discovered penicillin in 1928?",
          "a": "Alexander Fleming - antibiotic effect observed in a contaminated culture"
        },
        {
          "q": "Who patented the telephone in 1876?",
          "a": "Alexander Graham Bell - US patent 174,465 granted March 7, 1876"
        },
        {
          "q": "Which two scientists pioneered the CRISPR‑Cas9 gene‑editing method?",
          "a": "Emmanuelle Charpentier & Jennifer Doudna - landmark 2012 paper"
        },
        {
          "q": "Who invented the World Wide Web in 1989–90?",
          "a": "Tim Berners‑Lee - proposed HTTP, HTML, and the first web server/browser"
        },
        {
          "q": "Which engineer developed the first practical incandescent light bulb in 1879?",
          "a": "Thomas Edison - commercialized long‑lasting carbon filament bulbs"
        },
        {
          "q": "Which mathematician invented the mechanical calculator known as the Pascaline?",
          "a": "Blaise Pascal - 1640s adding machine for his tax‑collector father"
        },
        {
          "q": "What medical imaging technique uses strong magnets and radio waves?",
          "a": "MRI (magnetic resonance imaging) - non‑ionizing cross‑sectional scans"
        },
        {
          "q": "Which German physicist discovered X‑rays in 1895?",
          "a": "Wilhelm Röntgen - first Nobel Prize in Physics (1901)"
        },
        {
          "q": "What battery type powers most smartphones today?",
          "a": "Lithium‑ion - high energy density, rechargeable chemistry"
        },
        {
          "q": "Which early computer scientist wrote the 1936 paper that defined a universal machine?",
          "a": "Alan Turing - conceptual foundation of modern computing"
        }
      ]
    },
    {
      "title": "Philosophy & Religion",
      "items": [
        {
          "q": "Which text of Confucianism is a collection of sayings compiled by disciples?",
          "a": "The Analects - central source of Confucius’s teachings"
        },
        {
          "q": "Which Hindu scripture is a dialogue between Arjuna and Krishna?",
          "a": "The Bhagavad Gita - part of the Mahabharata"
        },
        {
          "q": "What is the method of questioning associated with Socrates?",
          "a": "The Socratic method - probing dialogue to test ideas"
        },
        {
          "q": "Which ethical theory is associated with Jeremy Bentham and John Stuart Mill?",
          "a": "Utilitarianism - actions judged by overall happiness produced"
        },
        {
          "q": "Which Buddhist teaching outlines suffering and its cessation?",
          "a": "The Four Noble Truths - core doctrine leading to the Eightfold Path"
        },
        {
          "q": "Which religion’s holy book is the Guru Granth Sahib?",
          "a": "Sikhism - scripture compiled by the Sikh Gurus"
        },
        {
          "q": "Which Islamic month involves fasting from dawn to sunset?",
          "a": "Ramadan - ninth month of the Islamic lunar calendar"
        },
        {
          "q": "What is the Jewish day of rest observed from Friday evening to Saturday evening?",
          "a": "Shabbat (Sabbath) - day of rest and spiritual renewal"
        },
        {
          "q": "Which branch of philosophy studies knowledge and justified belief?",
          "a": "Epistemology - examines the nature and scope of knowledge"
        },
        {
          "q": "What is the term for the belief that God and the universe are identical?",
          "a": "Pantheism - philosophical/theological view equating God with nature"
        }
      ]
    },
    {
      "title": "Environment & Ecology",
      "items": [
        {
          "q": "What is the world’s largest coral reef system?",
          "a": "The Great Barrier Reef - World Heritage site off Queensland, Australia"
        },
        {
          "q": "What term describes species found only in a particular region?",
          "a": "Endemic - restricted to a specific geographic area"
        },
        {
          "q": "Which gas is the primary driver of long‑term anthropogenic warming?",
          "a": "Carbon dioxide (CO₂) - potent greenhouse gas from fossil fuels"
        },
        {
          "q": "What process converts atmospheric nitrogen into usable forms for plants?",
          "a": "Nitrogen fixation - by lightning and nitrogen‑fixing microbes"
        },
        {
          "q": "What biome is characterized by permafrost and low‑growing vegetation?",
          "a": "Tundra - cold, treeless regions at high latitudes/elevations"
        },
        {
          "q": "Which international agreement aims to limit global warming to well below 2 °C?",
          "a": "The Paris Agreement - UNFCCC accord adopted in 2015"
        },
        {
          "q": "What do we call the variety of life at genetic, species, and ecosystem levels?",
          "a": "Biodiversity - enhances resilience and ecosystem services"
        },
        {
          "q": "Which renewable energy source uses moving air to turn turbines?",
          "a": "Wind power - converts kinetic energy into electricity"
        },
        {
          "q": "What is the major cause of ocean acidification?",
          "a": "Absorption of CO₂ - lowers seawater pH affecting marine life"
        },
        {
          "q": "What is the main layer of the atmosphere where weather occurs?",
          "a": "The troposphere - lowest layer containing most atmospheric mass"
        }
      ]
    },
    {
      "title": "Exploration & Cartography",
      "items": [
        {
          "q": "Who completed the first circumnavigation of the Earth after Magellan’s death?",
          "a": "Juan Sebastián Elcano - captained Victoria to Spain in 1522"
        },
        {
          "q": "Which map projection was introduced by Gerardus Mercator in 1569?",
          "a": "Mercator projection - preserves rhumb lines for navigation"
        },
        {
          "q": "Through which London site does the Prime Meridian pass?",
          "a": "Royal Observatory, Greenwich - defined as 0° longitude"
        },
        {
          "q": "Who reached the South Pole first, in December 1911?",
          "a": "Roald Amundsen - Norwegian explorer who beat Scott’s party"
        },
        {
          "q": "Which mountain is named after Surveyor General Sir George Everest?",
          "a": "Mount Everest - official name adopted in 1865 by the RGS"
        },
        {
          "q": "Which expedition reached the Pacific Ocean in November 1805?",
          "a": "Lewis & Clark Expedition - at the mouth of the Columbia River"
        },
        {
          "q": "What is the name of Earth’s galaxy supercluster containing the Local Group?",
          "a": "Laniakea - vast gravitational basin mapped in 2014"
        },
        {
          "q": "Which explorer’s 1492 voyage led to sustained European contact with the Americas?",
          "a": "Christopher Columbus - voyage under Spanish crown"
        },
        {
          "q": "What navigation instrument determines direction relative to Earth’s magnetic poles?",
          "a": "Magnetic compass - aligns with Earth’s magnetic field"
        },
        {
          "q": "Which island‑studded sea lies between Sweden and Finland?",
          "a": "The Baltic Sea’s Gulf of Bothnia - northern arm of the Baltic"
        }
      ]
    }
  ]
}