{
    "id": "entertainment_easy_04",
    "title": "Easy Entertainment Quiz 4",
    "sections": [
        {
            "title": "Entertainment",
            "items": [
                {
                    "type": "multiple-choice",
                    "q": "What legendary British pop group famously invaded America in 1964 with hits like 'I Want to Hold Your Hand'?",
                    "options": [
                        "The Rolling Stones",
                        "The Kinks",
                        "The Who",
                        "The Beatles"
                    ],
                    "a": "The Beatles",
                    "explanation": "Their arrival famously sparked 'Beatlemania' in the United States."
                },
                {
                    "type": "true-false",
                    "q": "In a movie theater, a 'matinee' refers exclusively to a showing late at night.",
                    "options": [
                        "True",
                        "False"
                    ],
                    "a": "False",
                    "explanation": "A matinee refers to a daytime performance, specifically in the afternoon."
                },
                {
                    "type": "true-false",
                    "q": "The famous red carpet rolled out for celebrities at premieres is meant to make them feel like royalty.",
                    "options": [
                        "True",
                        "False"
                    ],
                    "a": "True",
                    "explanation": "Rolling out the 'red carpet' historically signifies honor and high status."
                },
                {
                    "type": "self-eval",
                    "q": "Who is the legendary martial artist and actor famously known for movies like 'Enter the Dragon'?",
                    "a": "Bruce Lee.",
                    "explanation": "He is widely considered one of the most influential martial artists of all time."
                },
                {
                    "type": "self-eval",
                    "q": "What globally popular video sharing app allows users to create short, looping videos set to music?",
                    "a": "TikTok.",
                    "explanation": "The app exploded in popularity and severely disrupted the modern social media landscape."
                },
                {
                    "type": "self-eval",
                    "q": "In the context of acting, what does it mean to 'improvise' a lines?",
                    "a": "Making up dialogue or actions on the spot without a script.",
                    "explanation": "It heavily relies on the actor's spontaneous creativity and comedic timing."
                },
                {
                    "type": "self-eval",
                    "q": "What incredibly successful Broadway play tells the story of the witches of Oz before Dorothy arrived?",
                    "a": "Wicked.",
                    "explanation": "It tells the untold narrative of Elphaba, the famously misunderstood 'Wicked Witch of the West'."
                },
                {
                    "type": "self-eval",
                    "q": "Who is the critically acclaimed director of blockbuster films like 'Jaws', 'E.T.', and 'Jurassic Park'?",
                    "a": "Steven Spielberg.",
                    "explanation": "He is one of the most commercially successful directors in cinematic history."
                },
                {
                    "type": "self-eval",
                    "q": "What is the name of the famous magical school attended by Harry Potter?",
                    "a": "Hogwarts.",
                    "explanation": "The massive, enchanted castle is isolated in the Scottish Highlands."
                },
                {
                    "type": "self-eval",
                    "q": "What do we call a movie that is entirely drawn or generated by a computer rather than filmed with live people?",
                    "a": "An animated movie (or Animation).",
                    "explanation": "Classic examples include 'The Lion King', 'Shrek', and 'Spider-Man: Into the Spider-Verse'."
                }
            ]
        }
    ]
}