{
    "id": "music_medium_05",
    "title": "Medium Music Quiz 5",
    "sections": [
        {
            "title": "Music",
            "items": [
                {
                    "type": "multiple-choice",
                    "q": "Which popular term describes a musical composition designed to improve a player's technique?",
                    "options": [
                        "Sonata",
                        "Prelude",
                        "Etude",
                        "Symphony"
                    ],
                    "a": "Etude",
                    "explanation": "Etude translates to 'study' in French, and these pieces are famously complex in order to challenge performers."
                },
                {
                    "type": "true-false",
                    "q": "Sir Paul McCartney is an accomplished left-handed bass player.",
                    "options": [
                        "True",
                        "False"
                    ],
                    "a": "True",
                    "explanation": "Paul McCartney famously anchored The Beatles' rhythm section with his iconic left-handed Hofner bass."
                },
                {
                    "type": "true-false",
                    "q": "BPM in music production stands for 'Beats Per Meter'.",
                    "options": [
                        "True",
                        "False"
                    ],
                    "a": "False",
                    "explanation": "BPM stands for 'Beats Per Minute'."
                },
                {
                    "type": "self-eval",
                    "q": "In classical terminology, what does 'Aria' mean?",
                    "a": "An aria is a self-contained piece for one voice, with or without instrumental or orchestral accompaniment, typically part of a larger work such as an opera.",
                    "explanation": "Arias allow a soloist to express intense emotion or showcase vocal technique."
                },
                {
                    "type": "self-eval",
                    "q": "Describe the primary role playing of a rhythm guitar versus a lead guitar.",
                    "a": "A rhythm guitar generally provides the chords and rhythmic foundation for a song, while the lead guitar typically plays melodic lines, riffs, and solos.",
                    "explanation": "Both work closely together to create the full guitar sound in a rock band."
                },
                {
                    "type": "self-eval",
                    "q": "What is the defining instrument of a traditional Scottish pipe band?",
                    "a": "The Great Highland Bagpipe.",
                    "explanation": "These instruments have a distinct, loud drone sound and are often played alongside snare and tenor drums."
                },
                {
                    "type": "self-eval",
                    "q": "What famously distinct vocal technique is often associated with traditional Alpine folk music?",
                    "a": "Yodeling.",
                    "explanation": "Yodeling involves rapidly changing the voice from normal chest register to head register (falsetto)."
                },
                {
                    "type": "self-eval",
                    "q": "What does a 'soundbox' or 'resonator' do on acoustic instruments?",
                    "a": "It amplifies the sound generated by the vibrating strings (or skin) by displacing larger volumes of air.",
                    "explanation": "The body of an acoustic guitar or cello functions as a soundbox."
                },
                {
                    "type": "self-eval",
                    "q": "Explain the significance of the 'Grand Ole Opry'.",
                    "a": "The Grand Ole Opry is an iconic weekly country music stage concert in Nashville, Tennessee, fundamental to the history and popularization of country music.",
                    "explanation": "It frequently honors the genre's history and showcases new stars."
                },
                {
                    "type": "self-eval",
                    "q": "Who composed the music for the Star Wars film franchise?",
                    "a": "John Williams.",
                    "explanation": "He is one of the most prolific and recognized film composers in cinematic history."
                }
            ]
        }
    ]
}