{
    "id": "nature_hard_05",
    "title": "Hard Nature Quiz 5",
    "sections": [
        {
            "title": "Nature",
            "items": [
                {
                    "type": "multiple-choice",
                    "q": "Which oceanic zone is entirely devoid of sunlight, known commonly as the 'midnight zone'?",
                    "options": [
                        "Epipelagic",
                        "Mesopelagic",
                        "Bathypelagic",
                        "Neritic"
                    ],
                    "a": "Bathypelagic",
                    "explanation": "Lying beneath the mesopelagic zone, the bathypelagic lacks all penetrating sunlight, and its inhabitants often rely on bioluminescence."
                },
                {
                    "type": "true-false",
                    "q": "Lichens are a single type of plant.",
                    "options": [
                        "True",
                        "False"
                    ],
                    "a": "False",
                    "explanation": "Lichens are a composite organism arising from algae or cyanobacteria living among filaments of multiple fungi species in a mutualistic relationship."
                },
                {
                    "type": "true-false",
                    "q": "A 'moraine' is a mass of rocks and sediment carried down and deposited by a glacier.",
                    "options": [
                        "True",
                        "False"
                    ],
                    "a": "True",
                    "explanation": "Glaciers bulldoze this material dynamically, creating recognizable ridges upon retreating."
                },
                {
                    "type": "self-eval",
                    "q": "What is a 'trophic cascade'?",
                    "a": "A trophic cascade is an ecological phenomenon triggered by the addition or removal of top predators, which then causes dramatic resultant changes down through the entire food web.",
                    "explanation": "The reintroduction of wolves in Yellowstone modifying river behavior is a famous example."
                },
                {
                    "type": "self-eval",
                    "q": "Explain the difference between 'holocene' and 'anthropocene'.",
                    "a": "The Holocene is the current geological epoch that began after the last Ice Age approx 11,700 years ago. The Anthropocene is a proposed new epoch representing the period where significant human activity has critically impacted the Earth's geology and ecosystems.",
                    "explanation": "Both relate to Earth's recent geological timeline."
                },
                {
                    "type": "self-eval",
                    "q": "What is 'diapause' in insect biology?",
                    "a": "Diapause is a period of suspended development in an insect, other invertebrate, or mammal embryo, especially during unfavorable environmental conditions.",
                    "explanation": "It functions similarly to hibernation but involves halting developmental growth."
                },
                {
                    "type": "self-eval",
                    "q": "What defines a 'pelagic' bird?",
                    "a": "Pelagic birds, or seabirds, spend a significant portion of their lives on the open ocean, only returning to land mainly to breed.",
                    "explanation": "Albatrosses, petrels, and shearwaters are examples."
                },
                {
                    "type": "self-eval",
                    "q": "What does the 'Richter scale' actually measure about an earthquake?",
                    "a": "It measures the amplitude of the seismic waves generated by the earthquake (the amount of physical energy released).",
                    "explanation": "It is a base-10 logarithmic scale, meaning a magnitude 5.0 is ten times the amplitude of a 4.0."
                },
                {
                    "type": "self-eval",
                    "q": "Describe what a 'halophyte' is.",
                    "a": "A halophyte is a salt-tolerant plant that thrives in soil or waters of high salinity.",
                    "explanation": "Mangroves and salt marsh grasses are prime examples."
                },
                {
                    "type": "self-eval",
                    "q": "What is 'allelopathy'?",
                    "a": "Allelopathy is the biological phenomenon where an organism produces one or more biochemicals that influence the germination, growth, survival, and reproduction of other organisms.",
                    "explanation": "For example, black walnut trees produce a chemical (juglone) that inhibits the growth of nearby competing plants."
                }
            ]
        }
    ]
}